algorithms/46-Permutations.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:15 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>46.Permutations</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">46.Permutations</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgba01fc9">1. 题意分析</a></li>
<li><a href="#org7e5f608">2. java</a></li>
<li><a href="#org32b202f">3. python</a></li>
</ul>
</div>
</div>
<p>
Given a collection of distinct integers, return all possible permutations.<br>
</p>

<p>
Example:<br>
</p>

<pre class="example">
Input: [1,2,3]
Output:
[
  [1,2,3],
  [1,3,2],
  [2,1,3],
  [2,3,1],
  [3,1,2],
  [3,2,1]
]
</pre>


<div id="outline-container-orgba01fc9" class="outline-2">
<h2 id="orgba01fc9"><span class="section-number-2">1</span> 题意分析</h2>
<div class="outline-text-2" id="text-1">
<p>
给一个不重复整数集，输出所有可能组合<br>
</p>

<p>
思路：<br>
</p>

<p>
回溯法处理遍历所有情况问题<br>
</p>

<p>
1(234)-&gt;12(34)-&gt;123(4)<br>
</p>
</div>
</div>

<div id="outline-container-org7e5f608" class="outline-2">
<h2 id="org7e5f608"><span class="section-number-2">2</span> java</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">Solution</span> {

    <span style="color: #9d0006;">public</span> <span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">Integer</span>&gt;&gt; <span style="color: #b57614;">permute</span>(<span style="color: #8f3f71;">int</span>[] <span style="color: #076678;">nums</span>) {

        <span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">Integer</span>&gt;&gt; <span style="color: #076678;">list</span> = <span style="color: #9d0006;">new</span> <span style="color: #8f3f71;">ArrayList</span>&lt;<span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">Integer</span>&gt;&gt;();
        backtrack(list,nums,0);
        <span style="color: #9d0006;">return</span> list;

    }

    <span style="color: #9d0006;">public</span> <span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">Integer</span>&gt;&gt; <span style="color: #b57614;">backtrack</span>(<span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">Integer</span>&gt;&gt; <span style="color: #076678;">list</span>,<span style="color: #8f3f71;">int</span>[] <span style="color: #076678;">nums</span>,<span style="color: #8f3f71;">int</span> <span style="color: #076678;">start</span>){

         <span style="color: #9d0006;">if</span>(start &gt;= nums.length){
             <span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">Integer</span>&gt; <span style="color: #076678;">tempList</span> = convertArrayToList(nums);
             list.add(tempList);
         }

        <span style="color: #9d0006;">for</span>(<span style="color: #8f3f71;">int</span> <span style="color: #076678;">i</span> = start ; i &lt; nums.<span style="color: #8f3f71;">length</span> ;i++){
            swap(nums,start,i);
            backtrack(list,nums,start+1);
            swap(nums,start,i);
        }

        <span style="color: #9d0006;">return</span> list;

    }

    <span style="color: #9d0006;">private</span> <span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">Integer</span>&gt; <span style="color: #b57614;">convertArrayToList</span>(<span style="color: #8f3f71;">int</span>[] <span style="color: #076678;">nums</span>){

        <span style="color: #8f3f71;">List</span>&lt;<span style="color: #8f3f71;">Integer</span>&gt; <span style="color: #076678;">list</span> = <span style="color: #9d0006;">new</span> <span style="color: #8f3f71;">ArrayList</span>&lt;<span style="color: #8f3f71;">Integer</span>&gt;();
        <span style="color: #9d0006;">for</span>(<span style="color: #8f3f71;">int</span> <span style="color: #076678;">i</span> = 0 ; i &lt;nums.<span style="color: #8f3f71;">length</span>;i++){
            list.add(nums[i]);
        }

        <span style="color: #9d0006;">return</span> list;

    }

    <span style="color: #9d0006;">private</span> <span style="color: #8f3f71;">void</span> <span style="color: #b57614;">swap</span>(<span style="color: #8f3f71;">int</span>[] <span style="color: #076678;">num</span>,<span style="color: #8f3f71;">int</span> <span style="color: #076678;">i</span> ,<span style="color: #8f3f71;">int</span> <span style="color: #076678;">j</span>){
        <span style="color: #8f3f71;">int</span> <span style="color: #076678;">temp</span> = num[i];
        num[i] = num[j];
        num[j] = temp;
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org32b202f" class="outline-2">
<h2 id="org32b202f"><span class="section-number-2">3</span> python</h2>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>